<b> IMPORTING LIBRARIES

In [6]:
import pandas as pd

<b> READING BOTH DATASETS as DataFrames

In [7]:
df1 = pd.read_csv(r"C:\Users\apoojha\Desktop\Capstone\Capstone Project2_ Retail\Retail_datasets_P2\User_product_purchase_details_p2.csv")
df1

FileNotFoundError: [Errno 2] No such file or directory: 'C:\\Users\\apoojha\\Desktop\\Capstone\\Capstone Project2_ Retail\\Retail_datasets_P2\\User_product_purchase_details_p2.csv'

In [3]:
df2 = pd.read_csv(r"C:\Users\apoojha\Desktop\Capstone\Capstone Project2_ Retail\Retail_datasets_P2\user_demographics.csv")
df2

      User_ID Gender    Age  Occupation
0     1000001      F   0-17          10
1     1000002      M    55+          16
2     1000003      M  26-35          15
3     1000004      M  46-50           7
4     1000005      M  26-35          20
...       ...    ...    ...         ...
5886  1004588      F  26-35           4
5887  1004871      M  18-25          12
5888  1004113      M  36-45          17
5889  1005391      M  26-35           7
5890  1001529      M  18-25           4

[5891 rows x 4 columns]

#### MEARGING BOTH THE DATAFRAMES

In [4]:

df3 = df2.merge(df1,how = 'inner' , on = 'User_ID')
df3

,User_ID,Gender,Age,Occupation,Product_ID,City_Category,Stay_In_Current_City_Years,Marital_Status,Product_Category_1,Product_Category_2,Product_Category_3,Purchase
0,1000001,F,0-17,10,P00069042,A,2,0,3,NaN,NaN,8370
1,1000001,F,0-17,10,P00248942,A,2,0,1,6.0,14.0,15200
2,1000001,F,0-17,10,P00087842,A,2,0,12,NaN,NaN,1422
3,1000001,F,0-17,10,P00085442,A,2,0,12,14.0,NaN,1057
4,1000001,F,0-17,10,P00085942,A,2,0,2,4.0,8.0,12842
...,...,...,...,...,...,...,...,...,...,...,...,...
550063,1001529,M,18-25,4,P00053942,C,4+,1,1,2.0,5.0,15185
550064,1001529,M,18-25,4,P00182742,C,4+,1,1,2.0,14.0,11975
550065,1001529,M,18-25,4,P00242742,C,4+,1,1,2.0,9.0,11893
550066,1001529,M,18-25,4,P00063342,C,4+,1,1,2.0,9.0,11641
550067,1001529,M,18-25,4,P00375436,C,4+,1,20,NaN,NaN,492

# PURCHASE AMOUNT

<b> MEAN OF PURCHASE

In [5]:
meanp = df3['Purchase'].mean()
meanp

9263.968712959126

<b> MEDIAN PURCHASE AMOUNT

In [6]:
medp = df3['Purchase'].median()
medp

8047.0

<b> MODE OF PURCHASE AMOUNT

In [7]:
df3['Purchase'].mode()

0    7011
dtype: int64

<b> VARIANCE OF PURCHASE AMOUNT SPENT ON THE PRODUCTS

In [8]:
df3['Purchase'].var()

25231185.95059767

<b> STANDARD DEVIATION OF PURCHASE AMOUNTS

In [9]:
df3['Purchase'].std()

5023.065393820557

<b> MINIMUM PURCHASE AMOUNT

In [10]:
df3['Purchase'].min()

12

<b> MAXIMUM PURCHASE AMOUNT

In [11]:
df3['Purchase'].max()

23961

<b> RANGE OF PURCHASE AMOUNT

In [12]:
range1= df3['Purchase'].max() - df3['Purchase'].min()
range1

23949

<b> DESCRIPTION OF DATAFRAME df3

In [13]:
df3['Purchase'].describe()

count    550068.000000
mean       9263.968713
std        5023.065394
min          12.000000
25%        5823.000000
50%        8047.000000
75%       12054.000000
max       23961.000000
Name: Purchase, dtype: float64

INTERQUARTILE RANGE

<b> Details of Customers who have purchased more than mean purchase amount:

In [15]:
df3[df3['Purchase']>=meanp]

,User_ID,Gender,Age,Occupation,Product_ID,City_Category,Stay_In_Current_City_Years,Marital_Status,Product_Category_1,Product_Category_2,Product_Category_3,Purchase
1,1000001,F,0-17,10,P00248942,A,2,0,1,6.0,14.0,15200
4,1000001,F,0-17,10,P00085942,A,2,0,2,4.0,8.0,12842
6,1000001,F,0-17,10,P00110842,A,2,0,1,2.0,5.0,11769
7,1000001,F,0-17,10,P00004842,A,2,0,3,4.0,12.0,13645
11,1000001,F,0-17,10,P00000142,A,2,0,3,4.0,5.0,13650
...,...,...,...,...,...,...,...,...,...,...,...,...
550062,1001529,M,18-25,4,P00148442,C,4+,1,2,16.0,NaN,16245
550063,1001529,M,18-25,4,P00053942,C,4+,1,1,2.0,5.0,15185
550064,1001529,M,18-25,4,P00182742,C,4+,1,1,2.0,14.0,11975
550065,1001529,M,18-25,4,P00242742,C,4+,1,1,2.0,9.0,11893
550066,1001529,M,18-25,4,P00063342,C,4+,1,1,2.0,9.0,11641

# GENDER

<b> No. of unique gender categories:

In [17]:
df2['Gender'].nunique()

2

<b> No of Females:

In [18]:
df2[df2['Gender']=='F']['Gender'].count()

1666

<b> No of Males:

In [19]:
df2[df2['Gender']=='M']['Gender'].count()

4225

# OCCUPATION

<b> No. of unique Occupation:

In [20]:
df2['Occupation'].nunique()

21

<B> No of Customers belonging to each occupation:

In [24]:
odf1= pd.DataFrame(df2.groupby('Occupation')['User_ID'].count())
odf1

            User_ID
Occupation
0               688
1               517
2               256
3               170
4               740
5               111
6               228
7               669
8                17
9                88
10              192
11              128
12              376
13              140
14              294
15              140
16              235
17              491
18               67
19               71
20              273

CONCLUSION: Max no of customers belong to occupation '4'and Min no of customers belong to occupation '8'

<b> NUMBER OF CUSTOMERS BELONGING TO GENDER AND OCCUPATION

In [25]:
odf2= pd.DataFrame(df2.groupby(['Occupation' , 'Gender'])['User_ID'].count())
odf2

                   User_ID
Occupation Gender
0          F           226
           M           462
1          F           203
           M           314
2          F            88
           M           168
3          F            98
           M            72
4          F           228
           M           512
5          F            31
           M            80
6          F            99
           M           129
7          F           137
           M           532
8          F             3
           M            14
9          F            85
           M             3
10         F            66
           M           126
11         F            22
           M           106
12         F            46
           M           330
13         F            33
           M           107
14         F            78
           M           216
15         F            28
           M           112
16         F            49
           M           186
17         F            50
           M           441
18         F             4
           M            63
19         F            15
           M            56
20         F            77
           M           196

<b> AGE WISE DISTRIBUTION OF CUSTOMERS BASED ON THEIR OCCUPATION

In [8]:
odf3 = pd.DataFrame(df2.groupby(['Occupation' , 'Age'])['User_ID'].count())
odf3

NameError: name 'df2' is not defined

# Age

<b> TOTAL NO OF AGE GROUPS

In [27]:
df2['Age'].nunique()

7

<b> NO OF CUSTOMERS IN EACH AGE GROUP

In [28]:
adf1= pd.DataFrame(df2.groupby('Age')['User_ID'].count())
adf1

       User_ID
Age
0-17       218
18-25     1069
26-35     2053
36-45     1167
46-50      531
51-55      481
55+        372

CONCLUSION: Clearly, maximum customers are in the age range 26-35 and min belong to 0-17 age range

<B> No of males and Females in each Age Groups:

In [29]:
adf1= pd.DataFrame(df2.groupby(['Age','Gender'])['User_ID'].count())
adf1

              User_ID
Age   Gender
0-17  F            78
      M           140
18-25 F           287
      M           782
26-35 F           545
      M          1508
36-45 F           333
      M           834
46-50 F           182
      M           349
51-55 F           142
      M           339
55+   F            99
      M           273

In [35]:
adf1[adf1['User_ID']== adf1['User_ID'].max()].index

MultiIndex([('26-35', 'M')],
           names=['Age', 'Gender'])

Conclusion :  The max number of customers are Males in Age Group 26-35 and min are females in Age group 55+

# CITY CATEGORIES

<b> No. of City Categories:

In [37]:
df3['City_Category'].nunique()

3

<b> No. of  Customers in each City Category:

In [38]:
ccdf1= pd.DataFrame(df3.groupby('City_Category')['User_ID'].count())
ccdf1

               User_ID
City_Category
A               147720
B               231173
C               171175

CONCLUSION: City B has maximum number of customers,followed by C and A

<b> The total amount purchased by each city category:

In [39]:
ccdf2 = pd.DataFrame(df3.groupby(['City_Category']) ['Purchase'].sum())
ccdf2

                 Purchase
City_Category
A              1316471661
B              2115533605
C              1663807476

CONCLUSION: City B has the max purchase amount followed by City C and A

<b> City wise distribution of products being bought by the users

In [40]:
ccdf3 = pd.DataFrame(df3.groupby(['City_Category', 'Product_ID'])['User_ID'].count())
ccdf3

                          User_ID
City_Category Product_ID
A             P00000142       255
              P00000242        83
              P00000342        64
              P00000442        36
              P00000542        44
...                           ...
C             P0099442         47
              P0099642          3
              P0099742         41
              P0099842         33
              P0099942          1

[10321 rows x 1 columns]

In [41]:
ccdf3[ccdf3['User_ID'] == ccdf3['User_ID'].max()].index

MultiIndex([('C', 'P00265242')],
           names=['City_Category', 'Product_ID'])

In [50]:
set1 = set()

for i in ccdf3.index.get_level_values(0):
    set1.add(i)

list1 = list(set1)
    
for i in ccdf3.index.get_level_values(0):
    if i == list1[0]:
        max=

In [ ]:
CONCLUSION: In City Category C max

MultiIndex([('A', 'P00000142'),
            ('A', 'P00000242'),
            ('A', 'P00000342'),
            ('A', 'P00000442'),
            ('A', 'P00000542'),
            ('A', 'P00000642'),
            ('A', 'P00000742'),
            ('A', 'P00000842'),
            ('A', 'P00000942'),
            ('A', 'P00001042'),
            ...
            ('C',  'P0098942'),
            ('C',  'P0099042'),
            ('C',  'P0099142'),
            ('C',  'P0099242'),
            ('C',  'P0099342'),
            ('C',  'P0099442'),
            ('C',  'P0099642'),
            ('C',  'P0099742'),
            ('C',  'P0099842'),
            ('C',  'P0099942')],
           names=['City_Category', 'Product_ID'], length=10321)

# STAY IN CURRENT CITY YEAR

<b> No of uniques:

In [103]:
df3['Stay_In_Current_City_Years'].nunique()

5

<b> Count of Customers based on their stay in a city

In [105]:
sdf1 = pd.DataFrame(df3.groupby(['Stay_In_Current_City_Years'])['User_ID'].count())
sdf1

                            User_ID
Stay_In_Current_City_Years
0                             74398
1                            193821
2                            101838
3                             95285
4+                            84726

CONCLUSION: Max customers have stayed in their city for one year

<b> Count of customers and product_ID based on number of years of their stay

In [106]:
sdf2 = pd.DataFrame(df3.groupby(['Stay_In_Current_City_Years', 'Product_ID'])['User_ID'].count())
sdf2

                                       User_ID
Stay_In_Current_City_Years Product_ID
0                          P00000142       162
                           P00000242        50
                           P00000342        31
                           P00000442        14
                           P00000542        14
...                                        ...
4+                         P0099442         34
                           P0099642          2
                           P0099742         14
                           P0099842         17
                           P0099942          2

[16587 rows x 1 columns]

# Product_ID

<b> No of Unique Product Ids:

In [107]:
df3['Product_ID'].nunique()

3631

<b> Number of customers purchasing a particular product

In [108]:
pdf1 = pd.DataFrame(df3.groupby(['Product_ID'])['User_ID'].count())
pdf1

            User_ID
Product_ID
P00000142      1152
P00000242       376
P00000342       244
P00000442        92
P00000542       149
...             ...
P0099442        200
P0099642         13
P0099742        126
P0099842        102
P0099942         14

[3631 rows x 1 columns]

NameError: name 'pdf1' is not defined